#+LATEX_CLASS: ramsay-org-article
#+LATEX_CLASS_OPTIONS: [oneside,A4paper,12pt]
#+AUTHOR: Ramsay Leung
#+EMAIL: ramsayleung@gmail.com
#+DATE: 2025-07-20 Sun 16:06
** 1. Peter -> Paul -> Mary
   #+begin_src emacs-lisp :exports both
     (/(- (+ 100 10)  20) 2)
   #+end_src

   #+RESULTS:
   : 45
** 2. Peter -> Mary -> Paul 
   #+begin_src emacs-lisp :exports both
     (-(/ (+ 100 10)  2) 20)
   #+end_src

   #+RESULTS:
   : 35
** 3. Paul -> Peter -> Mary
   #+begin_src emacs-lisp :exports both
     (/(+ (- 100 20)  10) 2)
   #+end_src

   #+RESULTS:
   : 45
** 4. Paul -> Mary -> Peter

   #+begin_src emacs-lisp :exports both
     (+(/ (- 100 20)  2) 10)
   #+end_src

   #+RESULTS:
   : 50
** 5. Mary -> Peter -> Paul
   #+begin_src emacs-lisp :exports both
     (-(+(/ 100 2)10)20)
   #+end_src

   #+RESULTS:
   : 40

** 6. Marry -> Pual -> Peter
   #+begin_src emacs-lisp :exports both
     (+(-(/ 100 2)20)20)
   #+end_src

   #+RESULTS:
   : 50

